import React from 'react';
import { BackgroundPattern } from '../common/BackgroundPattern';
import { LawsList } from './LawsList';

export function AboutContent() {
  return (
    <div className="relative mx-auto max-w-5xl">
      <div className="absolute inset-0 bg-gray-200 rounded-2xl">
        <BackgroundPattern />
      </div>
      
      <div className="relative p-8 md:p-12 prose prose-lg mx-auto text-gray-600">
        <p className="mb-4">
          Ընկերության գրանցման վկայականի համարն է 02Ա 049516, գրանցված՝ 26.01.2001թ.: Միջազգային Ավիացիոն կոմիտեի կողմից 2003թ. և 2008թ. Ընկերությունը ստացել է Հայաստանի Հանրապետության տարածքում ավիացիոն բժշկությամբ զբաղվելու թույլտվության հավաստագիր:
        </p>
        <p className="mb-4">
          Ընկերության գտնվելու վայրը` 0042, ք. Երևան Զվարթնոց օդանավակայան:
        </p>
        <p className="mb-4">
          Ընկերության պետական մասնակցությունը կազմում է 100 (հարյուր) տոկոս: Ընկերության բաժնետիրոջ՝ Հայաստանի Հանրապետության անունից հանդես եկող պետական կառավարման լիազորված մարմինն է ՀՀ Տարածքային կառավարման և ենթակառուցվածքների նախարարությունը (ՏԿԵՆ):
        </p>
        <p className="mb-4">
          Ընկերությունը մատուցում է արտահիվանդանոցային բժշկական ծառայություններ՝ համաձայն ՀՀ առողջապահության նախարարության կողմից 15.12.2003թ. տրված թիվ Կ-XX-000492 լիցենիզայի և Քաղաքացիական ավիացիայի կոմիտեի կողմից 2024 թվականի հունիսի 4-ին ՔԱԿ նախագահի թիվ 282-Ա հրամանի հիման վրա տրված Համապատասխանության Վկայականի /անժամկետ/:
        </p>
        <p className="mb-4">
          Համապատասխանության Վկայականը հավաստում է «Ավիաբուժ» բժշկական կենտրոն» ՓԲԸ-ի համապատասխանությունը Քաղաքացիական ավիացիայի կազմակերպության (ICAO) Ավիացիոն բժշկության ձեռնարկով (Դոկ 8984) և Եվրամիության խորհրդի 2011 թվականի նոյեմբերի 3-ի թիվ 1178/2011` «Քաղաքացիական ավիացիայի անձնակազմին վերաբերվող տեխնիկական պահանջներ և վարչական ընթացակարգեր» կանոնակարգի Փարտ-Մեդ-ի (Part-Med), Փարտ-ԱՐԱ-ի (Part-ARA), Փարտ-ԳՐԱ-ի (Part-ORA) դրույթներով սահմանված բժշկական հաստատություններին ներկայացվող քաղաքացիական ավիացիոն բժշկության միջազգային պահանջների:
        </p>
        <LawsList />
      </div>
    </div>
  );
}