import React from 'react';

export function LawsList() {
  return (
    <>
      <p className="font-semibold mb-4">
        Ընկերությունը իր գործունեության ընթացքում ղեկավարվում է Հայաստանի Հանրապետության գործող օրենսդրությամբ, մասնավորապես․
      </p>
      <ul className="list-disc pl-6 space-y-2">
        <li>«Բաժնետիրական ընկերությունների մասին» ՀՀ օրենքով</li>
        <li>«Ավիացիայի մասին» ՀՀ օրենքով</li>
        <li>«Բնակչության բժշկական օգնության և սպասարկման մասին» ՀՀ օրենքով</li>
        <li>«Հայաստանի Հանրապետության օդանավակայաններում ավիացիոն անվտանգության հսկողության կազմակերպման եվ իրականացման կարգը հաստատելու մասին» ՀՀ Կառավարության 27.05.2004թ. թիվ 944-Ն որոշումով</li>
        <li>«Արտադրական միջավայրում և աշխատանքային գործընթացի վնասակար ու վտանգավոր գործոնների ազդեցությանը ենթարկվող բնակչության առանձին խմբերի առողջական վիճակի պարտադիր նախնական /աշխատանքի ընդունվելիս/ և պարբերական բժշկական զննության մասին» ՀՀ Կառավարության 15.07.2004թ. թիվ 1089-Ն որոշումով</li>
        <li>«Առողջական վիճակի պարտադիր նախնական (աշխատանքի ընդունվելիս) և պարբերական բժշկական զննության կարգը, գործունեության ոլորտների, որոնցում զբաղված անձինք ենթակա են առողջական վիճակի պարտադիր բժշկական զննության, և բժշկական զննության ծավալի ու հաճախականությունների ցանկը և անձնական սանիտարական (բժշկական) գրքույկի ու բժշկական զննության ենթակա անձանց անվանացուցակի ձեվերը հաստատելու մասին» ՀՀ 27.03.2003թվականի 347-Ն որոշումով</li>
        <li>«Հայաստանի Հանրապետության ավիացիոն բժշկական հաստատություններին քաղաքացիական ավիացիայի միջազգային կազմակերպությունների կողմից սահմանված պահանջներին համապատասխանության վկայականների տրման կարգը սահմանելու և Հայաստանի Հանրապետության կառավարությանն առընթեր քաղաքացիական ավիացիայի գլխավոր վարչության պետի 2014 թվականի դեկտեմբերի 5-ի թիվ 301-ն հրամանն ուժը կորցրած ճանաչելու մասին» ՀՀ ԿԱ ՔԱԿ նախագահի թիվ 1-Ն հրամանով</li>
        <li>«Բժշկական զննության արդյունքում Հայաստանի Հանրապետության քաղաքացիական ավիացիայի բնագավառի բժշկական սերտիֆիկատների հատկացման կարգը հաստատելու եվ Հայաստանի Հանրապետության կառավարությանն առընթեր քաղաքացիական ավիացիայի գլխավոր վարչության պետի 2007 թվականի ապրիլի 25-ի թիվ 65-Ն հրամանն ուժը կորցրած ճանաչելու մասին» ՀՀ Տարածքային կառավարման և ենթակառուցվածքների նախարարի 10 նոյեմբերի 2022թ. թիվ 19-Ն հրամանով</li>
      </ul>
    </>
  );
}