import { Language } from '../types/language';

export const translations = {
  [Language.Armenian]: {
    logo: 'ԱվիաՄեդ',
    nav: {
      services: 'ՄԵՐ ՄԱՍԻՆ',
      mission: 'ԱՌԱՔԵԼՈՒԹՅՈՒՆ',
      'our-services': 'ԾԱՌԱՅՈՒԹՅՈՒՆՆԵՐ',
      experts: 'ԱԲՓ',
      contact: 'ԿԱՊ',
    },
    hero: {
      title: 'Ավիաբուժ Բժշկական Կենտրոն',
      description: 'տեքստ',
      learnMore: 'Ավելին',
    },
    about: {
      title: 'ՄԵՐ ՄԱՍԻՆ',
      description: 'Ընկերությանգրանցման վկայականի համարն է 02Ա 049516,գրանցված՝ 26.01.2001թ.: Միջազգային Ավիացիոնկոմիտեի կողմից 2003թ. և 2008թ. Ընկերությունը ստացել էՀայաստանի Հանրապետության տարածքում ավիացիոնբժշկությամբ զբաղվելու թույլտվության հավաստագիր:',
      content: [
        'Ընկերության գտնվելու վայրը` 0042, ք. ԵրևանԶվարթնոց օդանավակայան:',
        'Ընկերության պետական մասնակցությունը կազմում է 100 (հարյուր) տոկոս:',
        'Ընկերության բաժնետիրոջ՝ Հայաստանի Հանրապետության անունից հանդես եկող պետական կառավարման լիազորված մարմինն է ՀՀ Տարածքային կառավարման և ենթակառուցվածքների նախարարությունը (ՏԿԵՆ):',
        'Ընկերությունը մատուցում է արտահիվանդանոցային բժշկական ծառայություններ՝ համաձայն ՀՀ առողջապահության նախարարության կողմից 15.12.2003թ. տրված թիվ Կ-XX-000492 լիցենիզայի ևՔաղաքացիական ավիացիայի կոմիտեի կողմից 2024թվականի հունիսի 4-ին ՔԱԿ նախագահի թիվ 282-Ահրամանի հիման վրա տրված ՀամապատասխանությանՎկայականի /անժամկետ/:',
        'Համապատասխանության Վկայականը հավաստում է «Ավիաբուժ» բժշկականկենտրոն» ՓԲԸ-ի համապատասխանությունըՔաղաքացիական ավիացիայի կազմակերպության(ICAO) Ավիացիոն բժշկության ձեռնարկով (Դոկ 8984) ևԵվրամիության խորհրդի 2011 թվականի նոյեմբերի 3-իթիվ 1178/2011` «Քաղաքացիական ավիացիայիանձնակազմին վերաբերվող տեխնիկականպահանջներ և վարչական ընթացակարգեր»կանոնակարգի Փարտ-Մեդ-ի (Part-Med), Փարտ-ԱՐԱ-ի(Part-ARA), Փարտ-ԳՐԱ-ի (Part-ORA) դրույթներովսահմանված բժշկական հաստատություններիններկայացվող քաղաքացիական ավիացիոն բժշկությանմիջազգային պահանջների:'
      ],
      lawsTitle: 'Ընկերությունը իր գործունեության ընթացքումղեկավարվում է Հայաստանի Հանրապետության գործող օրենսդրությամբ, մասնավորապես․',
      laws: [
        '«Բաժնետիրական ընկերությունների մասին» ՀՀօրենքով',
        '«Ավիացիայի մասին» ՀՀ օրենքով',
        '«Բնակչության բժշկական օգնության և սպասարկման մասին» ՀՀ օրենքով',
        '«Հայաստանի Հանրապետության օդանավակայաններում ավիացիոն անվտանգության հսկողության կազմակերպման եվ իրականացման կարգը հաստատելու մասին» ՀՀ Կառավարության27.05.2004թ. թիվ 944-Ն որոշումով',
        '«Արտադրական միջավայրում և աշխատանքայինգործընթացի վնասակար ու վտանգավոր գործոններիազդեցությանը ենթարկվող բնակչության առանձինխմբերի առողջական վիճակի պարտադիրնախնական /աշխատանքի ընդունվելիս/ ևպարբերական բժշկական զննության մասին» ՀՀԿառավարության 15.07.2004թ. թիվ 1089-Ն որոշումով',
        '«Առողջական վիճակի պարտադիր նախնական(աշխատանքի ընդունվելիս) և պարբերականբժշկական զննության կարգը, գործունեությանոլորտների, որոնցում զբաղված անձինք ենթակա ենառողջական վիճակի պարտադիր բժշկականզննության, և բժշկական զննության ծավալի ուհաճախականությունների ցանկը և անձնականսանիտարական (բժշկական) գրքույկի ու բժշկականզննության ենթակա անձանց անվանացուցակիձեվերը հաստատելու մասին» ՀՀ 27.03.2003թվականի 347-Ն որոշումով',
        '«Հայաստանի Հանրապետության ավիացիոն բժշկական հաստատություններին քաղաքացիական ավիացիայի միջազգային կազմակերպությունների կողմից սահմանված պահանջներին համապատասխանության վկայականների տրման կարգը սահմանելու և Հայաստանի Հանրապետության կառավարությանն առընթեր քաղաքացիական ավիացիայի գլխավոր վարչության պետի 2014 թվականի դեկտեմբերի 5-ի թիվ 301-ն հրամանն ուժը կորցրած ճանաչելու մասին» ՀՀ ԿԱ ՔԱԿ նախագահիթիվ 1-Ն հրամանով',
        '«Բժշկական զննության արդյունքում Հայաստանի Հանրապետության քաղաքացիական ավիացիայի բնագավառի բժշկական սերտիֆիկատների հատկացման կարգը հաստատելու եվ Հայաստանի Հանրապետության կառավարությանն առընթեր քաղաքացիական ավիացիայի գլխավոր վարչության պետի 2007 թվականի ապրիլի 25-ի թիվ 65-Ն հրամանն ուժը կորցրած ճանաչելու մասին» ՀՀ Տարածքային կառավարման և ենթակառուցվածքների նախարարի10 նոյեմբերի 2022թ. թիվ 19-Ն հրամանով'
      ],
    },
    mission: {
      title: 'ԱՌԱՔԵԼՈՒԹՅՈՒՆ',
      content: [
        'Ընկերությունը ՀՀ ավիացիոն ոլորտում ցուցաբերում է բժշկական օգնություն և սպասարկում: Ընկերությունը բժշկական զննման արդյունքում հատկացնում էպիտանի լինելու հավաստագրեր թռչող և կարգավարական անձնակազմերին,բորտուղեկցորդներին,նաև անցկացնում է ավիացիոն ոլորտի այլ մասնագետների բժշկական զննությունը: Քաղաքացիական ավիացիայի բնագավառումԸնկերության գերակա և առաջնային  խնդիրն էթռիչքների բժշկա-սանիտարական անվտանգությանկազմակերպումը և ապահովումը:',
        'Ընկերությունում աշխատող բոլոր բժիշկները ունեն գործող Շարունակական մասնագիտական զարգացման հավաստագրեր, ինչպես նաև տարիներ շարունակվերապատրաստվել են ՌԴ Միջպետական ԱվիացիոնԿոմիտեի (ՄԱԿ) մասնագետների կողմից, մասնակցել ենԵվրամիության խորհրդի կողմից JAR ծրագրիշրջանակներում կազմակերպված դասընթացներին ևստացել են եվրոպական ստանդարտներինհամապատասխան ավիացիոն բժշկականհավաստագրեր: Ընկերության կողմից ավիացիոն մասնագետներին բժշկական վկայականների տրամադրման համար ընդգրկված բժիշկները 2022 թվականին անցել են ավիացիոն բժշկական փորձագետի հիմնական դասընթացը՝ /BASIC/ 60-ժամյա ծավալով տեսական և պրակտիկ՝ հիբրիդային առցանց և առկա ձևաչափով դասընթացը և համապատասխանաբար հավաստագրվել։',
        'Այժմ Ընկերությունը ունի 3 հավաստագրված ավիաբժշկական փորձագետներ:',
        'Ընկերությունը մեծ դեր է կատարում վթարա-փրկարարական միջոցառումների ժամանակ: Ապահովում է ոչ միայն անհրաժեշտ անհետաձգելի օգնության ամբողջ ծավալ, այլ նաև կազմակերպում է ծառայությունների համագործակցված աշխատանք, որոնողական և վթարա-փրկարարականաշխատանքների կազմակերպման ժամանակ: Տարեց տարի ավելի մեծ ուշադրություն է դարձվում քաղացիական պաշտպանության պահանջների, վթարա-փրկարարական աշխատանքների կազմակերպման  ուղղությամբ: Ողջ անձնակազմը,գործող պլանի համաձայն, պարբերաբար վերապատրաստվում է Արտակարգ իրավիճակների նախարարության կողմից կազմակերպված ընթացիկ պարապմունքներին մասնակցելով:'
      ],
    },
    services: {
      title: 'ԾԱՌԱՅՈՒԹՅՈՒՆՆԵՐ',
      list: [
        'Թռչող և կարգավարական աձնակազմերի, բորտուղեկցորդների և ավիացիոն այլ մասնագետների ավիա բժշկական փորձաքննություն',
        'Վերգետնյա աշխատողների նախնական և պարբերական պարտադիր բուժզննություն',
        'Բժշկական խորհրդատվություն',
        'Թռչող անձնակազմերի,  կարգավարների նախաթռիչքային/նախահերթափոխային բժշկական զննություն',
        'Օդանավակայանի աշխատողների և ուղևորների անհետաձգելի առաջին բժշկական օգնություն',
        'Սանիտարա-հիգիենիկ ծառայություններ',
        'Վերականգնողական կենտրոն /մարզասրահ, շոգեբաղնիք/',
        'Խորհրդատվություն, հետազոտություն',
        'Նեղ մասնագետներ',
        '• ԱԲՓ (ավիաբժշկական փորձագետ)',
        '• Թերապևտ',
        '• Նյարդաբան',
        '• Ակնաբույժ',
        '• Քիթ-կոկորդ-ականջաբան',
        '• Վիրաբույժ',
        '• Մաշկաբան',
        '• Հոգեբույժ',
        '• Հոգեբան',
        '• Սրտաբան',
        'Գործիքային հետազոտություններ',
        '• ԷՍԳ',
        '• ՈւՁՀ',
        '• Աուդիոմետրիա',
        '• R-գրաֆիա',
        '• Վելոէրգոմետրիա',
        '• Սպիրոմետրիա',
        'Լաբորատոր հետազոտություններ',
        '• Կլինիկական',
        '• Բակտերիոլոգիական',
        '• Մանրէաբանական'
      ],
    },
    contact: {
      title: 'Կապվեք Մեզ Հետ',
      description: 'Հարցերի դեպքում առկա են հեռախոսահամար և էլ. հասցե:',
    },
  },
  // ... other languages remain the same
} as const;

