import type { TranslationSchema } from '../../types/language';

export const russianTranslations: TranslationSchema = {
  logo: 'Авиамед',
  nav: {
    services: 'О НАС',
    mission: 'МИССИЯ',
    'our-services': 'УСЛУГИ',
    experts: 'АМЭ',
    contact: 'КОНТАКТЫ',
  },
  hero: {
    title: 'Авиамед Медицинский Центр',
    learnMore: 'Подробнее',
  },
  about: {
    title: 'О НАС',
    description: 'Закрытое акционерное общество «Медицинский центр «Авиамед» /далее: Компания/ создано (реорганизовано) на основании решения Правительства Республики Армения за № 828 от 16.12.2000г. и приказа Начальника Управления гражданской авиации при Правительстве РА за №3 от 09.01.2001г. путем отделения от ЗАО МА «Звартноц» Регистрационный номер Компании 02А 049516 от 26.01.2003г. \nВ 2003г. и 2008г. Компании был выдан сертификат-разрешение на занятие авиационной медициной на территории Республики Армения.',
    content: [
      'Юридический адрес: 0042, гр. Ереванский аэропорт Звартноц.',
      'Государственное участие в Компании составляет 100 (Сто) процентов. Уполномоченным органом государственного управления, действующим от имени Правительства РА, является Министерство территориального управления и инфраструктур Республики Армения (МТУИ).',
      'Компания оказывает амбулаторно-поликлинические медицинские услуги в соответствии с лицензией № К-ХХ-000492, выданной приказом Министерства здравоохранения РА от 15.12.2003г. и с сертификатом соответствия /бессрочный/, выданным приказом Комитета гражданской авиации за № 282-А от 04.06.2024г.',
      'Сертификат соответствия удостоверяет соответствие Компании международным требованиям к авиационной медицине, установленных Руководством по авиационной медицине (Doc 8984) Международной организацией гражданской авиации (ИКАО) и Положением «Технические требования и административные процедуры для персонала гражданской авиации» Совета ЕвроСоюза № 1178/2011 от 3 ноября 2011г. (Part-Med, Part-ARA, Part-GRA, Part-ORA).'
    ],
    lawsTitle: 'В своей деятельности компания руководствуется действующим законодательством Республики Армения, в частности:',
    laws: [
      '• Законом РА «Об акционерных обществах»,',
      '• Законом РА «Об авиации»,',
      '• Законом РА «О медицинской помощи и обслуживании населения»,',
      '• Решением Правительства Республики Армения за № 944-Н от 27.05.2004г. «Об утверждении Порядка организации и осуществления контроля авиационной безопасности в аэропортах Республики Армения»,',
      '• Решением Правительства РА № 1089-Н от 15.07.2004г. «Об обязательном предварительном /при приеме на работу/ и периодическом медицинском осмотре отдельных групп населения, подвергающихся воздействию вредных и опасных факторов в производственной среде и трудовом процессе»,',
      '• Решением Правительства РА за 347-Н от 27.03.2003г. «О порядке обязательного первичного (при приеме на работу) и периодического медицинского осмотра состояния здоровья, перечень сфер деятельности, в которых работающие лица подлежат обязательному медицинскому осмотру по состоянию здоровья, а также объеме и периодичности медицинского осмотра, а также о личной санитарной (медицинской) книжки и утверждении форм списка лиц, подлежащих медицинскому освидетельствованию»,',
      '• Приказом Председателя КГА при Правительстве РА за № 1 от 05.12.2014г. «Об установлении порядка выдачи авиационным медицинским учреждениям Республики Армения сертификатов соответствия требованиям международных организаций гражданской авиации и отмене приказа начальника Главного управления гражданской авиации при Правительстве Республики Армения № 301»,',
      '• Приказом министра Территориального управления и инфраструктур РА за № 19-Н от 10.11.2022г. «Об утверждении порядка выдачи медицинских сертификатов в сфере гражданской авиации Республики Армения по результатам медицинского освидетельствования и отзыве приказа начальника главного управления гражданской авиации от 25 апреля 2007 года № 65-Н гражданской авиации при правительстве Республики Армения».'
    ],
  },
  mission: {
    title: 'МИССИЯ',
    content: [
      'Компания оказывает медицинскую помощь и обслуживание в авиационной сфере РА. По результатам медицинского освидетельствования компания выдает свидетельства о годности летного и диспетчерского состава и бортпроводников, а также проводит медицинское освидетельствование других специалистов авиационной сферы. Основной и первоочередной задачей Компании в сфере гражданской авиации является организация и обеспечение медико-санитарной безопасности полетов.',
      'Все врачи, работающие в Компании, имеют действующие сертификаты о повышении квалификации, а также прошли многолетнее обучение у специалистов Межгосударственного авиационного комитета РФ (МАК), участвовали в курсах, организованных Советом Европейского Союза в рамках программы JAR, и получили авиационные медицинские сертификаты в соответствии с европейскими стандартами. В 2022 году врачи Компании, вовлеченные в процесс получения медицинских свидетельств авиационных специалистов, прошли базовый курс авиационного медицинского эксперта /BASIC/ 60 часов теоретии и практики, в формате гибридного онлайн-курса, и получилисоответствующие сертификаты.',
      'Сейчас в компании работают 3 сертифицированных специалиста в области авиационной медицины.',
      'Компания играет важную роль в проведении аварийно-спасательных работ. Она оказывает не только необходимую экстренную помощь в полном объеме, но и организует слаженную работу служб при организации аварийно-спасательных работ. С каждым годом все больше внимания уделяется требованиям гражданской обороны в направлении организации аварийно-спасательных работ. Весь личный состав, согласно действующему плану, регулярно проходит обучение, участвуя в текущих тренингах, организуемых МЧС.'
    ],
  },
  services: {
    title: 'УСЛУГИ',
    list: [
      'Компания осуществляет следующие услуги:',
      'Авиамедицинская экспертиза летного и диспетчерского составов, бортпроводников и других авиационных специалистов',
      '1. Предварительное и периодическое медицинское освидетельствование наземных служащих',
      '2. Медицинская консультация',
      '3. Предполетный/предсменный медицинский осмотр летного состава и диспетчеров, наземных служб',
      '4. Первая неотложная медицинская помощь работникам аэропорта и пассажирам',
      '5. Санитаро-гигиенические услуги',
      '6. Восстановительный центр /спортзал, сауна/',
      'Консультации, исследования',
      'Узкие специалисты',
      '• АМЭ (авиамедицинский эксперт)',
      '• Терапевт',
      '• Невролог',
      '• Офтальмолог',
      '• Оториноларинголог',
      '• Хирург',
      '• Дерматолог',
      '• Психиатр',
      '• Психолог',
      '• Кардиолог',
      'Инструментальные исследования',
      '• ЭКГ',
      '• УЗИ',
      '• Аудиометрия',
      '• Р-графия',
      '• Велоэргометрия',
      '• Спирометрия',
      'Лабораторные исследования',
      '• Клиническая',
      '• Бактериологическая'
    ],
  },
  contact: {
    title: 'Свяжитесь с нами',
    description: 'По всем вопросам доступны телефон и электронная почта:',
  },
};